IDEA Open Model
CrossSectionFactory.FillCHSPar Method
Compatible with IDEA StatiCa 20.1
 Circular hollow section - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillCHSPar(
	CrossSectionParameter css,
	double D,
	double t
)
Public Shared Sub FillCHSPar (
	css As CrossSectionParameter,
	D As Double,
	t As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
D
Type: System.Double
Diameter
t
Type: System.Double
thickness
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace